configuration/src/InformationRegisters/ИсторияМинимальныхСтатусовЗаявок/ИсторияМинимальныхСтатусовЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияМинимальныхСтатусовЗаявок</name>
  <comment>Хранит историю минимальных статусов заявок</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ИсторияМинимальныхСтатусовЗаявок/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
	
#Область ПрограммныйИнтерфейс

// Добавляет запись в историю минимальных статусов заявок
//
// Параметры:
//  Заявка		 - ДокументСсылка.ЗаявкаНаРазработку - ссылка на заявку
//  Статус		 - СправочникСсылка.СтатусыОбъектов	 - минимальный статус заявки
//  СдвигВремени - Число							 - величина сдвига времени в секундах относительно текущей даты сеанса
//
Процедура Добавить(Знач Заявка, Знач Статус, Знач СдвигВремени = 0) Экспорт
	
	Период = ТекущаяДатаСеанса();
	
	Если СдвигВремени < 0 Тогда
		Период = Период + СдвигВремени;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Заявка.Установить(Заявка);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;
	НоваяЗапись.Заявка = Заявка;
	НоваяЗапись.Статус = Статус;
	НоваяЗапись.Автор = ПараметрыСеанса.ТекущийПользователь;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
